app/views/slides/show.html.erb

  <%= @slide.likes %>
  <% if current_user.slides.find_by(id: @slide.id)
---
SELECT  "slides".* FROM "slides" WHERE "slides"."id" = ? LIMIT 1  [["id", 2]]