project2/app/controllers/sessions_controller.rb

  def create
  	account = Account.find_by(user_name: params[:account][:user_name] )
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_name" = ? LIMIT 1  [["user_name", "mona"]]