app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_name" = ? LIMIT 1  [["user_name", "mona"]]
INSERT INTO "accounts" ("user_name", "first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @account = Account.new(account_params)
    @account.password = params[:account][:password]
if (  (!Account.find_by(user_name: @account.user_name) ) )
      if  @account.save