app/controllers/pdf_files_controller.rb

SELECT  "pdf_files".* FROM "pdf_files" LIMIT 10 OFFSET 0
---
  def index
  	@pdf_file =PdfFile.all.paginate(page: params[:page], per_page: 10)

INSERT INTO "pdf_files" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "first file"], ["attachment", "L3.pdf"], ["created_at", "2016-02-08 17:06:48.612098"], ["updated_at", "2016-02-08 17:06:48.612098"]]
INSERT INTO "slides" ("title", "likes", "pdf_file_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "0_ffff.jpg"], ["likes", 0], ["pdf_file_id", 13], ["created_at", "2016-02-12 21:56:36.802757"], ["updated_at", "2016-02-12 21:56:36.802757"]]
---
  def create
    @pdf_file =PdfFile.new(pdf_file_params)

    if @pdf_file.save
       pdf = Magick::ImageList.new("public#{@pdf_file.attachment}")
      pdf.each_with_index do |img, i|
        img.write "app/assets/images/#{@pdf_file.name}_#{i+1}.jpg"
        @pdf_file.slides.create(title: "#{@pdf_file.name}_#{i+1}.jpg", likes: 0, p_num: i+1)

SELECT  "pdf_files".* FROM "pdf_files" WHERE "pdf_files"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "pdf_files" WHERE "pdf_files"."id" = ?  [["id", 1]]
---
  def destroy
  	@pdf_file =PdfFile.find(params[:id])
    @pdf_file.destroy