app/controllers/slides_controller.rb

  def index
    @slides = PdfFile.find(params[:pdf_file_id]).slides.paginate(page: params[:page], per_page: 10)
    @pdf_file = PdfFile.find(params[:pdf_file_id])
---
SELECT  "slides".* FROM "slides" WHERE "slides"."pdf_file_id" = ? LIMIT 10 OFFSET 0  [["pdf_file_id", 17]]
SELECT COUNT(*) FROM "slides" WHERE "slides"."pdf_file_id" = ?  [["pdf_file_id", 18]]
SELECT  "pdf_files".* FROM "pdf_files" WHERE "pdf_files"."id" = ? LIMIT 1  [["id", nil]]

  def show
    @slides = PdfFile.find(params[:pdf_file_id]).slides
---
SELECT  "slides".* FROM "slides" WHERE "slides"."id" = ? LIMIT 1  [["id", 2]]